# DeleteAssemblyInstWithViewsWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..DeleteAssemblyInstWithViewsWarn Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Deleting this assembly will remove the assembly from the project and any views associated with that assembly.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DeleteAssemblyInstWithViewsWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DeleteAssemblyInstWithViewsWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DeleteAssemblyInstWithViewsWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace